{
    "entry_point": "pcvrp_problem:PCVRPProblem",
    "default_params": {
      "instance_file": "instances/A-n32-k5_1.txt"
    },
    "problem_type": "Prize-Collecting Vehicle Routing Problem",
    "description": "In the Prize-Collecting Vehicle Routing Problem (PCVRP), a fleet of vehicles with uniform capacity must serve customers with known demand and prize values. The vehicles start and end at a common depot. Each customer is served by at most one vehicle. The total delivered demand must reach or exceed a predetermined amount. The objectives, in lexicographic order, are to minimize the number of trucks used, maximize the total prize collected, and minimize the total distance traveled. This model computes route quantities, route distances (using provided distance matrices for customer-to-customer and depot-to-customer distances), and route prizes. A candidate solution is given as a set of routes (one per truck) that form a partition of the customer set.",
    "keywords": [
      "vehicle routing",
      "prize collecting",
      "PCVRP",
      "optimization",
      "routing"
    ],
    "data_format": {
      "instance_file": {
        "format": "A text file in the Long et al. format. The first line contains the number of vehicles, the vehicle capacity, and the minimum total demand that must be satisfied. The second line describes the depot (node ID, x-coordinate, y-coordinate). Each subsequent line describes a customer (node ID, x-coordinate, y-coordinate, demand, prize)."
      }
    },
    "decision_variables": {
      "routes": {
        "type": "list of lists of int",
        "description": "A list of routes, one per truck. Each route is a list of customer indices (with customers numbered from 1 to nb_customers) representing the visiting order."
      }
    },
    "objective": {
      "type": "lexicographic minimization",
      "function": "Objective = (# trucks used)*1e9 - (total prize)*1e6 + (total distance)",
      "description": "The objective is to minimize the number of trucks used, maximize the total prize collected (by subtracting a weighted prize term), and minimize the total distance traveled by all trucks. All constraints regarding vehicle capacity and minimum total demand are enforced."
    },
    "solution_representation": "A dictionary with key 'routes' mapping to a list of routes (one per truck).",
    "compatible_optimizers": [
      "genetic_algorithm",
      "simulated_annealing",
      "particle_swarm",
      "tabu_search"
    ]
  }
  